[
  {
    "title": "I asked ChatGPT, Gemini, and other AIs how to combat aging, and only one did the right thing",
    "text": "Age is just a number, or so people entering late middle age like to say. It's also inevitable. No matter where you are on life's journey, you are growing up, getting older, slouching toward expiration. It's only natural that we turn to the most readily available technology for answers about the inevitable. And no, I'm not talking about those ridiculous light masks. Instead, I'm asking AI to ponder my deterioration.\n\nI'm not the only one. Multi-millionaire Bryan Johnson is turning his quest to forestall death into a religion and one that has a deep connection to AI.\n\nIn a recent interview with MIT Technology Review, Johnson outlined his plans for a new \"Don't Die\" religion and how AI could factor into our longevity. He wants to train models on things like conflict resolution, which I assume could help us avoid wars that lead to, tragically, lots more death.\n\nBut for Johnson, who has invested deeply in extending his own life, AI will not only change how we treat ourselves, it may also impact how we view religion. AI's ubiquity (and growing influence and power) may lead people to think of their bodies as \"God.\"\n\nHeady stuff, I know. More practically, though, Johnson said he's feeding his body data into an algorithm. \"I’ve been testing the hypothesis that if I get a whole bunch of data about my body, and I give it to an algorithm, and feed that algorithm updates with scientific evidence, then it would eventually do a better job than a doctor. So I gave myself over to an algorithm,\" he told MIT.\n\nLike Johnston, I'm deeply invested in my longevity, but without the millions to spend on it. I do, though, have access to myriad AIs that are all, I presume, ready and willing to guide me on my physical journey.\n\nEven though I haven't fed all my physical data into these AI systems, I assumed each one of them could offer some useful advice and maybe help me turn back the hands of time, if only a little bit.\n\nGet daily insight, inspiration and deals in your inbox Sign up for breaking news, reviews, opinion, top tech deals, and more. Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nA question of age\n\nI posed the same question to ChatGPT, Copilot, Gemini, and Claude AI: \"What's the best way to combat aging?\"\n\nChatGPT leaped right into some well-worn advice, telling me:\n\n\"Staying active, eating a balanced diet, and keeping a positive mindset can really help. Regular exercise and maintaining strong social connections are also important. And don’t forget to keep your brain engaged with new challenges and learning opportunities. Is there any specific area you’d like to focus on?\"\n\nThis is all good and unsurprising advice, and since it asked, I followed up with, \"How do I look younger?\"\n\nAs I expected, ChatGPT talked about hydration, sunscreen, eating fruits and vegetables, sleep, and exercise. One thing I didn't know is that vitamin C can help.\n\nAI is my Copilot\n\nI switched to Microsoft's platform (which, like ChatGPT, is based on OpenAI models).\n\nSeeming to understand my anxiety, Copilot started by talking me down off the proverbial ledge:\n\n\"Aging is a natural part of life, but focusing on a few key areas can help you age gracefully. Staying active keeps your body strong, while a balanced diet filled with fruits, veggies, lean proteins, and healthy fats nourishes your skin and cells. Don't underestimate the power of staying mentally sharp, too, whether that's through learning new things or keeping social connections alive. How about a creative hobby or meditation for a mental boost?\"\n\nI like the \"aging gracefully\" part. Copilot knows we're not talking about trying to live forever, as I think Johnston may be trying to do, but decaying with grace (and maybe courage). Its advice was a bit more general than ChatGPT's, but it, too, mentioned my diet and physical activity.\n\nAI anti-aging aswers. From left-to-right, ChatGPT, Copilot, Claude AI, and Gemini. (Image credit: Future)\n\nClaude's textbook approach\n\nUnlike ChatGPT and Copilot, Anthropic's Claude AI can't answer in voice, so its response was far less conversational and offered a more textbook approach to anti-aging:\n\n\"There are many evidence-based approaches to combat aging and promote longevity. Here’s what science currently suggests:\n\n1. Dietary strategies - Caloric restriction, intermittent fasting, and Mediterranean or DASH diets have shown longevity benefits\n\n2. Regular exercise - Both aerobic and resistance training help maintain muscle mass, cardiovascular health, and cognitive function\n\n3. Sleep optimization - 7-8 hours of quality sleep supports cellular repair and immune function\n\n4. Stress management - Chronic stress accelerates aging through inflammation and telomere shortening\n\n5. Social connection - Strong relationships are consistently linked to longer lifespans\n\n6. Cognitive engagement - Learning new skills and mental challenges support brain health\n\n7. Supplements - Some show promise but with varying evidence (NAD+ precursors, resveratrol)\n\n8. Lifestyle choices - Avoiding smoking, limiting alcohol, and minimizing UV exposure protect against premature aging\n\nTo be honest, this was some of the best advice. I appreciate the detail around lifestyle choices, perhaps because they align with some of my own.\n\nDoctor Gemini\n\nOf all the AI chatbots I spoke to, only Gemini added a big and, I think, important caveat at the beginning and end of its generative advice:\n\n\"This is for informational purposes only. For medical advice or diagnosis, consult a professional.\n\nWhile aging is a natural process, there are ways to promote healthy aging. A balanced diet, regular exercise, and stress management techniques can help. Prioritizing quality sleep and staying socially connected can also make a big difference. And of course, don't forget the importance of regular checkups with your doctor.\n\nJust a reminder that I don't provide medical advice or diagnoses. You should always talk to a medical professional.\"\n\nSure, the lawyers probably made Google add that, but it's a good reminder that while AIs like Copilot, ChatGPT, Claude, Gemini, and others are always looking to help, their advice should always be taken with a grain of salt.\n\nConsult your doctor\n\nIt's not just that AIs can still hallucinate, but what they know about our bodies and health is still a compendium of fact and opinion-based information pulled from countless sources and training. The models and algorithms meld it to give you the best possible advice. As you can see, most of it is accurate, but, for now at least, these AIs do not know you and may not know, for instance, that you have a Vitamin C allergy or that physical activity is difficult for you because of a disability.\n\nUltimately, you have to take their advice as suggestions and then, as Gemini says, consult a professional.\n\nThere may come a time when, as Bryan Johnson predicts, we're pouring all of our data into these systems and they know more about us than a doctor and have more information at their fingertips than any one healthcare professional ever could. But we are not there yet. So while Johnston relies on AI to help him make anti-aging choices, you should still talk to your doctor first.\n\nAlso, I think I need to start using moisturizer.",
    "url": "https://www.techradar.com/computing/artificial-intelligence/i-asked-chatgpt-gemini-and-other-ais-how-to-combat-aging-and-only-one-did-the-right-thing",
    "pub_date": "2025-05-05T15:06:00+00:00",
    "authors": [
      "Lance Ulanoff",
      "Editor At Large",
      "Social Links Navigation"
    ],
    "source": "www.techradar.com"
  },
  {
    "title": "eM Client version 10.3 adds features familiar from Postbox",
    "text": "(Información remitida por la empresa firmante)\n\nNEWS AKTUELL // Prague – 05.05.2025 - The Czech company eM Client has launched a new version of its eponymous email application, positioning their software as the primary rival to Microsoft Outlook in the email app market. The most recent release, version 10.3, also incorporates the most popular features from Postbox, an email application developed by Postbox Inc., which has ceased operations and was acquired by eM Client in 2024.\n\neM Client 10.3 aims to make the transition for Postbox users as easy as possible by adding many unique and powerful Postbox features that significantly boost eM Client’s ability to smoothly and efficiently tackle a busy inbox. New features include:\n\n• Account Groups — enabling users to gather similar email accounts together\n\n• Profiles — allows users to separate data, for example, for home and work use\n\n• Single-stroke keyboard shortcuts - for rapidly navigating, categorizing, and filing email, including Quick Move, Quick Copy, Quick Tag and more\n\n• Signature and QuickText libraries — pre-made formatted signatures and text snippets you can save or insert into your messages\n\n• New rules actions — playing a sound or inserting words at the beginning or end of a subject line.\n\n• Visual differences between event statuses — Free, Busy, Tentative, and Out of Office statuses have different opacity and hatching.\n\nIn its 18 years of existence, eM Client has become a comprehensive tool for managing emails, as well as calendar, contacts, tasks and notes. It also features integrated chat, including support for group chats such as Microsoft Teams, Slack and Rocket.Chat.\n\nAll this new and improved functionality folds perfectly into eM Client’s industry-leading feature set that includes conversation view, inbox categories, quick translation, email snooze, and support for tags, signatures, templates, quick text snippets and macros. eM Client also recently introduced full AI integration.\n\neM Client offers both subscription pricing and one-time purchase options, and has welcomed Postbox users with a significant limited-time discount as another way of helping ease their transition to our friendly and powerful software.\n\nAbout eM Client\n\neM Client (emclient.com) was founded in 2006 with a clear goal: to develop the best email application. eM Client combines broad functionality with a modern and intuitive interface. Its qualities, including professional support, are appreciated by more than 2,500,000 users and 100,000 companies worldwide.\n\nContact\n\nSchwartz Public Relations\n\nSven Kersten-Reichherzer\n\nemclient@schwartzpr.de\n\n+49 89 211 871 36",
    "url": "https://www.notimerica.com/comunicados/noticia-comunicado-em-client-version-103-adds-features-familiar-from-postbox-20250505130630.html",
    "pub_date": "2025-05-05T13:06:30+02:00",
    "authors": [
      "Europa Press"
    ],
    "source": "www.notimerica.com"
  },
  {
    "title": "Addio Skype. Ecco cosa succede ai dati degli utenti e le migliori alternative",
    "text": "Skype è ufficialmente chiuso. Dopo oltre vent’anni di servizio e miliardi di chiamate, il celebre software che ha cambiato per sempre il modo di comunicare a distanza ha smesso di esistere. A partire dal 5 maggio 2025, Microsoft ha interrotto definitivamente il supporto e la distribuzione di Skype, segnando la fine di un’epoca digitale.\n\nLa nascita di Skype: una rivoluzione nelle comunicazioni\n\nNato nel 2003 da un’idea degli imprenditori Niklas Zennström e Janus Friis insieme a un team di sviluppatori estoni, Skype fu un’innovazione straordinaria: la prima piattaforma in grado di offrire chiamate gratuite via Internet attraverso una tecnologia peer-to-peer. Un progetto visionario che ha demolito le barriere geografiche, abbattuto i costi della comunicazione internazionale e reso possibile, per la prima volta, sentirsi vicini anche da continenti diversi.\n\nIl boom delle videochiamate e la crescita esponenziale\n\nNel 2005, con l’introduzione della videochiamata, Skype divenne il punto di riferimento non solo per le comunicazioni personali, ma anche per quelle aziendali e istituzionali. Milioni di utenti lo installarono sui propri computer e, più tardi, sui primi smartphone, trasformandolo in uno strumento quotidiano e irrinunciabile. In poco tempo, Skype superò i cento milioni di utenti attivi, divenendo sinonimo stesso di “videochiamata”.\n\nLe difficoltà nel restare competitivo\n\nIl percorso, però, non è stato lineare. Il primo passaggio di proprietà a eBay nel 2005 e quello successivo, nel 2011, a Microsoft per 8,5 miliardi di dollari, segnarono un cambio di rotta. Con l’ingresso del colosso di Redmond, Skype iniziò a essere integrato nei sistemi Windows, ma perse via via quella snellezza e reattività che l’avevano reso iconico. In un mondo sempre più orientato alla mobilità e all’instant messaging, Skype ha faticato ad adattarsi.\n\nIl cambiamento del mercato delle comunicazioni digitali\n\nL’arrivo di concorrenti come WhatsApp, Zoom, Google Meet e Telegram ha trasformato il mercato delle comunicazioni digitali. Mentre le nuove app offrivano un’esperienza più intuitiva, veloce e integrata con i dispositivi mobili, Skype è rimasto legato a un’interfaccia desktop poco flessibile. Anche la distinzione tra Skype personale e Skype for Business ha creato confusione tra gli utenti e rallentato l’adozione di nuove funzionalità.\n\nMicrosoft punta su Microsoft Teams\n\nNel contesto del declino di Skype, Microsoft ha scelto di concentrare gli sforzi su Microsoft Teams, una piattaforma inizialmente pensata per il lavoro collaborativo, ma ormai capace di offrire anche funzionalità gratuite per l’uso quotidiano. Microsoft ha invitato tutti gli utenti Skype a migrare su Teams, dove potranno ritrovare contatti, chat, cronologia e preferenze. Teams offre anche strumenti avanzati come la gestione dei calendari, la creazione di comunità e l’integrazione con le app di Office.\n\nCome migrare da Skype a Microsoft Teams\n\nPer gli utenti che desiderano conservare le proprie conversazioni e contatti, Microsoft ha messo a disposizione una procedura per migrare facilmente a Teams, utilizzando le stesse credenziali di Skype. È possibile iniziare a usare Teams scaricando l’app per desktop o mobile e seguendo questi passaggi:\n\nAccedi a Microsoft Teams (teams.microsoft.com). Effettua il login con le stesse credenziali utilizzate su Skype (email e password dell’account Microsoft). Teams importerà automaticamente i contatti Skype associati allo stesso account. Per trasferire chat o file importanti, è possibile esportare i dati da Skype seguendo la procedura ufficiale di Microsoft. All’interno di Teams, gli utenti potranno iniziare a chattare, avviare videochiamate o creare gruppi di lavoro.\n\nMicrosoft Teams è gratuito?\n\nSì, Microsoft Teams è disponibile anche in versione gratuita, che include chat illimitate, videochiamate di gruppo fino a 60 minuti, 5 GB di archiviazione su OneDrive e l’integrazione con le app di Microsoft Office online. Le funzionalità avanzate, come maggiore spazio cloud e strumenti di amministrazione, sono disponibili con la versione a pagamento inclusa in Microsoft 365.\n\nQuali dati verranno cancellati con la chiusura di Skype?\n\nCon la dismissione definitiva del servizio, Skype non migrerà automaticamente i dati degli utenti. Chat, contatti, file e registrazioni saranno disponibili solo per chi ha effettuato un’esportazione manuale prima della chiusura del servizio. Dopo la data limite, i server verranno disattivati e tutti i contenuti saranno cancellati in modo definitivo.\n\nÈ possibile usare Skype anche dopo la chiusura?\n\nSè e no. La certezza è che Skype non sarà più utilizzabile dopo il 5 maggio 2025. Microsoft ha progressivamente disattivato il supporto tecnico e rimosso le app dagli store. Tentare di accedere al servizio restituirà un messaggio di dismissione, invitando gli utenti a migrare su Teams. Gli unici contenuti ancora disponibili saranno quelli precedentemente esportati in locale. Ma anche dopo la chiusura di Skype, sarà possibile continuare a utilizzare il credito Skype e gli abbonamenti attivi per effettuare chiamate nazionali e internazionali. Gli utenti possono utilizzare il credito rimanente su calling.skype.com, il servizio web che permette di chiamare numeri fissi e mobili a livello globale. Inoltre, è possibile continuare a beneficiare delle funzionalità di chiamata anche su Teams Free, garantendo la continuità nelle comunicazioni. È fondamentale utilizzare eventuali abbonamenti prima che vengano disattivati definitivamente con la chiusura del servizio.\n\nSkype è stato un pioniere, un simbolo dell’innovazione tech nata fuori dalla Silicon Valley, capace di cambiare il mondo della comunicazione. La sua eredità vive oggi in tutte le app che ogni giorno ci permettono di lavorare, parlare, ridere e vivere a distanza. Un’era si è conclusa, ma ha lasciato dietro di sé un modello culturale e tecnologico che ha insegnato a tutti cosa significa essere connessi.",
    "url": "https://www.panorama.it/tempo-libero/tecnologia/addio-skype-ecco-cosa-succede-ai-dati-degli-utenti-e-le-migliori-alternative",
    "pub_date": "2025-05-05T11:55:17+00:00",
    "authors": [
      "Marianna Baroli",
      "The Following Styles Get Applied Both On The Front Of Your Site",
      "In The Editor.",
      "Replace Them With Your Own Styles Or Remove The File Completely.",
      ".Bc-Author-Box.Bc-Author-Box--Multiple",
      "Display",
      "Flex",
      "Gap",
      "Align-Items",
      "Center"
    ],
    "source": "www.panorama.it"
  }
]