{
  "entries": [
    {
      "title": "JPMorgan says AI helped boost sales, add clients in market turmoil",
      "source": "Reuters",
      "date": "May 5, 2025",
      "link": "https://www.reuters.com/business/finance/jpmorgan-says-ai-helped-boost-sales-add-clients-market-turmoil-2025-05-05/",
      "overview": "JPMorgan Chase's artificial-intelligence tools enabled it to boost sales to wealthy clients and manage scores of requests from worried customers during April's market volatility.",
      "full_content": "NEW YORK, May 5 (Reuters) - JPMorgan Chase's (JPM.N) artificial-intelligence tools enabled it to boost sales to wealthy clients and manage scores of requests from worried customers even during April's market rout, the bank's CEO of asset and wealth management said.\n\nThe largest U.S. lender has been ramping up its use of AI, along with its peers. Goldman Sachs (GS.N) is rolling out a generative AI assistant to its bankers, traders and asset managers, while Morgan Stanley (MS.N) developed a chatbot for its financial advisers with OpenAI.\n\nJPMorgan's AI tools supercharged the speed at which its bankers could provide research and investment advice to wealthy clients last month at a time when the U.S. tariff announcements erased trillions of dollars from the stock market.\n\n\"In the last few weeks, there have been several fluctuations in the market which are not in normal bite sizes, making it very complicated to think about all your clients and all the things required to do,\" Mary Erdoes, JPMorgan's CEO of asset and wealth management, told Reuters. The powerful AI tools helped advisers to quickly handle client requests by pulling data on their trading patterns and anticipating queries, she said.\n\nIn the days surrounding U.S. President Donald Trump's tariff announcement last month, U.S. stock markets set a record for single-day trading volume, and posted some of the sharpest intraday swings of the past 50 years.\n\n\"When you have a tool that pre-populates all the data and the movement in real time, while also remembering clients' old investment preferences and helps in tailoring a plan for them quickly, it also allows advisers to do much more,\" she added.\n\nJPMorgan's so-called Coach AI tool used by private client advisers is quicker at locating content and research to drive conversations with clients.\n\n\"Our advisers are finding the right information up to 95% faster — which means they spend less time searching and more time engaging in meaningful conversations with clients,\" said Mike Urciuoli, chief information officer at JPMorgan asset and wealth management.\n\n### ADDING CLIENTS\n\nThe app will help advisers expand their client rosters by 50% in the next three-to-five years by enabling them to take on more clients, with AI handling some of the other research-related work.\n\nJPMorgan Asset & Wealth Management also said gross sales between 2023 and 2024 increased by 20%, with GenAI-driven tools helping teams focus more effectively on high-impact client work.\n\n\"AI has also been handling a lot of anticipatory work, allowing advisers to be prepared for what could have otherwise been a very stressful moment with market movements,\" Erdoes said.\n\nJPMorgan had a technology budget of $17 billion last year. The bank already has about 450 potential cases for which it could use AI, and CEO Jamie Dimon expects those potential applications to surge to 1,000 by next year, he said earlier this year.\n\nPortfolio managers in asset management are also using the AI tools, Erdoes said.\n\nThe bank's GenAI toolkit is now deployed on the desktops of more than 200,000 employees, more than half of whom use it several times a day, the bank said. The bank employs almost 320,000 people.\n\n\"We are trying to democratize AI and put it in the hands of more employees instead of a select group,\" Erdoes added.\n\nHarvard Business School recently published a case study on the potential of generative AI which included the tools being used by the 4,000 advisers serving JPMorgan's high-net-worth private bank clients to study its impact on the bank's business.\n\nThe initiatives have already saved the bank nearly $1.5 billion through fraud prevention, personalization, trading, operational efficiencies and credit decisions, JPMorgan said.\n\nMike Mayo, an analyst at Wells Fargo, expects the financial benefits from AI to go up by another billion dollars for the bank.\n\n\"JPMorgan is a goliath and the goliath has been winning on AI. It is able to spend more money, have a cohesive strategy and incorporate the benefits to gain more share,\" said Mayo.\n\nReporting by Nupur Anand in New York; Editing by Lananh Nguyen and Matthew Lewis.",
      "keywords": ["jpmorgan", "ai", "wealth management", "financial services", "banking"]
    },
    {
      "title": "US SEC ends inquiry into Morgan Stanley's cash sweep program with no enforcement action",
      "source": "Reuters",
      "date": "May 6, 2025",
      "link": "https://www.reuters.com/business/finance/us-sec-ends-inquiry-into-morgan-stanleys-cash-sweep-program-with-no-enforcement-2025-05-06/",
      "overview": "The U.S. Securities and Exchange Commission has ended its inquiry into Morgan Stanley's cash sweep program for advisory accounts with no enforcement action.",
      "full_content": "May 6 (Reuters) - The U.S. Securities and Exchange Commission has ended its inquiry into Morgan Stanley's (MS.N) cash sweep program for advisory accounts, concluding with no enforcement action, the Wall Street bank said in a filing on Monday.\n\nThe SEC had been examining whether Morgan Stanley's program, which automatically transfers uninvested client cash into higher-yielding accounts, complied with new rules introduced after the 2008 financial crisis. Morgan Stanley said it cooperated fully with the SEC and that the program remains unchanged.\n\nReporting by [Your Name]; Editing by [Editor].",
      "keywords": ["morgan stanley", "sec", "regulation", "cash sweep", "compliance", "banking"]
    },
    {
      "title": "Wells Fargo to buy back up to $40 bln of its common stock",
      "source": "Reuters",
      "date": "April 29, 2025",
      "link": "https://www.reuters.com/business/finance/wells-fargo-buy-back-up-40-bln-its-common-stock-2025-04-29/",
      "overview": "Wells Fargo's board authorized a stock buyback program of up to $40 billion, which will commence upon completion of the current repurchase plan.",
      "full_content": "April 29 (Reuters) - Wells Fargo (WFC.N) said on Tuesday that its board had authorized a stock buyback program of up to $40 billion.\n\nThe new plan will take effect upon the completion of the current repurchase program, it said.\n\nReporting by Jaiveer Singh Shekhawat in Bengaluru; Editing by Anil D'Silva.",
      "keywords": ["wells fargo", "buyback", "capital management", "share repurchase", "banking"]
    },
    {
      "title": "Goldman Sachs lowers oil price forecast after OPEC+ decision to boost output",
      "source": "Reuters",
      "date": "May 5, 2025",
      "link": "https://www.reuters.com/markets/commodities/goldman-sachs-lowers-oil-price-forecast-after-opec-decision-boost-output-2025-05-05/",
      "overview": "Goldman Sachs cut its oil price forecasts, now expecting Brent crude to average $60 per barrel in 2025 and $56 in 2026, following OPEC+'s decision to increase output.",
      "full_content": "May 5 (Reuters) - Goldman Sachs reduced its oil price forecast following decisions by the Organization of the Petroleum Exporting Countries and its allies, OPEC+, to accelerate oil output increases, the bank said in a note dated Sunday.\n\nThe bank now expects Brent crude to average $60 per barrel for the rest of 2025 and $56/bbl in 2026, down by $2 from its previous estimate. It has also cut its forecast for West Texas Intermediate crude by $3/bbl, to $56/bbl for the remainder of 2025 and $52/bbl in 2026.\n\nGoldman Sachs views the OPEC+ decision as a long-term equilibrium strategy aimed at maintaining internal cohesion and strategically regulating U.S. shale supply amid relatively low inventories. The bank anticipates a further 0.41 mb/d output increase in July, up from an earlier estimate of 0.14 mb/d.\n\nThe revised forecast reflects both the recent production decisions and unexpectedly strong economic data, suggesting the demand slowdown may not yet be evident. Despite tight spot fundamentals, Goldman Sachs sees downside risks for oil prices due to high spare capacity and recession concerns.\n\nBrent futures were trading at $60.02 a barrel by 0802 GMT, while U.S. WTI was at $56.96 a barrel.\n\nReporting by Anmol Choubey in Bengaluru; Editing by Louise Heavens.",
      "keywords": ["goldman sachs", "oil forecast", "opec+", "commodities", "banking"]
    },
    {
      "title": "Citigroup CEO says most business clients can absorb 10% tariffs",
      "source": "Reuters",
      "date": "May 5, 2025",
      "link": "https://www.reuters.com/business/finance/citigroup-ceo-says-most-clients-can-absorb-10-tariffs-2025-05-05/",
      "overview": "Citigroup CEO Jane Fraser said most of the bank's business clients could absorb U.S. tariffs of 10%, though higher rates would be more challenging, and noted many are delaying investments amid economic uncertainty.",
      "full_content": "NEW YORK, May 5 (Reuters) - Citigroup (C.N) CEO Jane Fraser said on Monday most of the bank's business clients could absorb U.S. tariffs of 10% on trading partners, but cautioned that companies are holding off on investments and hiring until there is more economic clarity.\n\n\"If it is 10%, most of the clients we talk to say, 'Yeah we can absorb that,' if it is 25%, not so much,\" Fraser said at the Milken Institute Global Conference in Los Angeles.\n\n\"Most companies are in a bit of limbo land, … and in that investment spending, some of that is being suspended, some of the decisions on capex and hiring are on hold. That will have an impact on demand and the economy.\"\n\nShe noted tariffs could influence supply chains and pricing, and that clients are preparing for headwinds by strengthening their balance sheets.\n\nThe U.S. economy contracted in the first quarter for the first time in three years amid a rush to import ahead of potential tariffs. The IMF projects U.S. GDP growth of 1.8% for 2025.\n\nReporting by Saeed Azhar; Editing by Leslie Adler and Andrea Ricci.",
      "keywords": ["citigroup", "tariffs", "trade policy", "corporate clients", "banking"]
    },
    {
      "title": "Three VPs to leave TD Bank's anti-money laundering team as new chief makes changes",
      "source": "Reuters",
      "date": "May 1, 2025",
      "link": "https://www.reuters.com/sustainability/boards-policy-regulation/three-vps-leave-td-banks-anti-money-laundering-team-new-chief-makes-changes-2025-05-01/",
      "overview": "TD Bank's incoming chief compliance officer has reorganized the bank's AML function, leading to the departure of three vice presidents as part of efforts to strengthen controls after high-profile compliance lapses.",
      "full_content": "TORONTO, May 1 (Reuters) - Three vice presidents have left TD Bank's anti-money laundering team following the appointment of a new head of financial crime controls, sources familiar with the matter said on Thursday. The departures are part of a broader shake-up aimed at reinforcing the bank's compliance framework after regulators identified shortcomings in how the bank monitored certain high-risk accounts. TD said it was committed to \"continuous improvement\" in its financial crime prevention protocols and would fill the roles with experienced hires in the coming weeks.",
      "keywords": ["td bank", "aml", "compliance", "risk management", "banking"]
    },
    {
      "title": "Canadian lender RBC abandons sustainable finance goals citing competition act",
      "source": "Reuters",
      "date": "April 29, 2025",
      "link": "https://www.reuters.com/sustainability/cop/canadian-lender-rbc-abandons-sustainable-finance-goals-2025-04-29/",
      "overview": "Royal Bank of Canada said it is dropping its commitment to facilitate C$500 billion in sustainable financing by 2025, after amendments to Canada's Competition Act limited its ability to substantiate environmental claims.",
      "full_content": "TORONTO, April 29 (Reuters) - RBC announced on Tuesday that it will no longer publicly report certain sustainability metrics, including its previously stated C$500 billion sustainable finance target, due to new Competition Act requirements that companies must substantiate environmental claims. The bank said it has revised its reporting methodology and will continue tracking these metrics internally, but cannot disclose them under the amended law. RBC also unveiled a refreshed, action-oriented climate strategy focused on financing low-carbon projects.",
      "keywords": ["rbc", "sustainable finance", "competition act", "environmental claims", "banking", "compliance"]
    },
    {
      "title": "BMO to Redeem $1.25 billion Series J medium-term notes",
      "source": "Refinitiv via Reuters",
      "date": "May 6, 2025",
      "link": "https://www.tradingview.com/news/reuters.com%2C2025-05-07%3Anewsml_RSG5813Ha%3A0-reg-bank-of-montreal-bmo-to-redeem-series-j-med-term-notes-nvcc-tr-2/",
      "overview": "Bank of Montreal will redeem its $1.25 billion Series J subordinated notes on June 15, reflecting its ongoing balance-sheet optimization under Basel III standards.",
      "full_content": "MONTREAL, May 6 (Refinitiv) - BMO announced it will redeem its $1.25 billion Series J non-viability contingent capital (NVCC) medium-term notes on June 15, 2025, at their principal amount plus accrued interest. The move is part of the bank's ongoing efforts to manage its capital ratios under evolving regulatory guidelines and to reduce the cost of its funding mix.",
      "keywords": ["bmo", "debt redemption", "nvcc", "capital ratios", "banking", "risk management"]
    },
    {
      "title": "Bank of Canada says trade uncertainty has pushed risks higher overall",
      "source": "Reuters",
      "date": "May 8, 2025",
      "link": "https://www.reuters.com/world/americas/full-text-bank-canada-says-trade-uncertainty-has-pushed-risks-higher-overall-2025-05-08/",
      "overview": "In its latest Financial System Review, the Bank of Canada highlighted that global trade tensions are elevating downside risks to growth and financial stability, particularly via cross-border credit channels.",
      "full_content": "May 8 (Reuters) - The Bank of Canada said on Thursday that elevated uncertainty around U.S. tariffs and trade negotiations has increased risks to the Canadian economy and financial system. The central bank noted vulnerabilities in corporate and household balance sheets and warned that a sudden escalation in tariffs could trigger a sharp repricing in global asset markets.",
      "keywords": ["bank of canada", "trade uncertainty", "financial stability", "risk assessment", "banking", "risk management"]
    },
    {
      "title": "CIBC Tech & Innovation Market Update – May 2025, Volume 61",
      "source": "CIBC Capital Markets (via CIBC website)",
      "date": "May 9, 2025",
      "link": "https://cibccm.com/en/insights/articles/cibc-tech-innovation-market-update-may-2025-volume-61/",
      "overview": "CIBC's latest equity research report covers a $396 million venture-capital surge in Canadian tech in April, led by AI and software deals, and assesses valuations for the sector.",
      "full_content": "TORONTO, May 9 (CIBC Capital Markets) - The Canadian venture capital market raised $396 million across 50 deals in April, with 60% of funding directed to software firms. The report highlights growing investor interest in AI-enabled startups and suggests a rotation into mid-stage opportunities as valuations moderate.",
      "keywords": ["cibc", "venture capital", "tech sector", "equity research", "technology forecast", "banking"]
    },
    {
      "title": "Apple's Safari revamp plan with AI search a likely blow to Google dominance",
      "source": "Reuters",
      "date": "May 7, 2025",
      "link": "https://www.reuters.com/business/apple-looks-add-ai-search-companys-browser-bloomberg-reports-2025-05-07/",
      "overview": "Apple is planning to integrate AI-powered search into Safari, potentially displacing Google as the default engine and disrupting the $20 billion annual payout Google makes to Apple.",
      "full_content": "May 7 (Reuters) - Apple is exploring significant AI enhancements to its Safari browser, including integrating generative search providers such as OpenAI's ChatGPT and Perplexity AI, Bloomberg reported. The move could threaten Google's $20 billion annual arrangement as Safari's default search engine and shake up the digital advertising market.",
      "keywords": ["apple", "safari", "ai search", "browser", "google", "technology forecast"]
    },
    {
      "title": "Apple is developing specialized chips for smart glasses and AI servers, Bloomberg News reports",
      "source": "Reuters",
      "date": "May 8, 2025",
      "link": "https://www.reuters.com/world/china/apple-is-developing-specialized-chips-smart-glasses-ai-servers-bloomberg-news-2025-05-08/",
      "overview": "According to Bloomberg, Apple is designing new in-house silicon for AR glasses, next-gen MacBooks, and AI servers—aiming for production in 2026–27 to power its emerging Apple Intelligence platform.",
      "full_content": "May 8 (Reuters) - Apple's next phase of custom chip development will target its first smart-glasses platform, AI inference servers, and the rumored M6/M7 MacBook chips, Bloomberg reported. Mass production is expected by late 2026, leveraging TSMC's advanced nodes to optimize power efficiency for AR/VR and on-device AI workloads.",
      "keywords": ["apple", "custom silicon", "ar glasses", "ai servers", "technology forecast"]
    },
    {
      "title": "Microsoft wins appeal in FTC challenge to $69 billion Activision Blizzard deal",
      "source": "Reuters",
      "date": "May 7, 2025",
      "link": "https://www.reuters.com/legal/microsoft-wins-ftc-appeal-challenging-69-bln-activision-blizzard-deal-2025-05-07/",
      "overview": "A U.S. appeals court denied the FTC's bid to block Microsoft's acquisition of Activision Blizzard, clearing the last major legal hurdle to close the $69 billion deal.",
      "full_content": "May 7 (Reuters) - The 9th U.S. Circuit Court of Appeals unanimously upheld a lower court's ruling, rejecting the FTC's request for an injunction against Microsoft's $69 billion purchase of Activision Blizzard. The decision ends the FTC's administrative challenge and allows the transaction to proceed.",
      "keywords": ["microsoft", "activision", "mergers & acquisitions", "antitrust", "compliance"]
    },
    {
      "title": "Amazon cloud revenue, income forecast disappoint, shares slide",
      "source": "Reuters",
      "date": "May 1, 2025",
      "link": "https://www.reuters.com/business/retail-consumer/amazon-forecasts-quarterly-revenue-largely-above-estimates-2025-05-01/",
      "overview": "Amazon Web Services reported 16.9% Q1 growth to $29.27 billion—its slowest in five quarters—and gave softer-than-expected Q2 income guidance, sending shares down 5%.",
      "full_content": "May 1 (Reuters) - AWS revenue rose 16.9% in Q1 to $29.27 billion, missing analysts' 17.4% target. Amazon forecast Q2 operating income of $13 billion–$17.5 billion, below the $17.7 billion consensus. CEO Andy Jassy noted minimal tariff impact so far but warned of potential cost pressures.",
      "keywords": ["amazon", "aws", "cloud computing", "guidance", "technology forecast"]
    },
    {
      "title": "OpenAI negotiates with Microsoft for new funding and future IPO, FT reports",
      "source": "Reuters",
      "date": "May 11, 2025",
      "link": "https://www.reuters.com/business/openai-negotiates-with-microsoft-unlock-new-funding-future-ipo-ft-reports-2025-05-11/",
      "overview": "According to the Financial Times, OpenAI is in talks to adjust terms with Microsoft—its largest investor—to secure fresh capital and pave the way for a potential IPO while redefining revenue-share arrangements.",
      "full_content": "May 11 (Reuters) - OpenAI and Microsoft are renegotiating their multi-billion-dollar partnership to lock in additional funding and outline OpenAI's path to a possible IPO. Key discussion points include Microsoft's equity stake in OpenAI's for-profit arm and adjustments to revenue sharing post-2030.",
      "keywords": ["openai", "funding", "microsoft", "ipo", "technology forecast"]
    }
  ],
  "keywords": {
    "jpmorgan": [0],
    "ai": [0, 10, 11],
    "morgan stanley": [1],
    "sec": [1],
    "wells fargo": [2],
    "goldman sachs": [3],
    "opec+": [3],
    "citigroup": [4],
    "tariffs": [4],
    "td bank": [5],
    "aml": [5],
    "rbc": [6],
    "sustainable finance": [6],
    "bmo": [7],
    "nvcc": [7],
    "bank of canada": [8],
    "trade uncertainty": [8],
    "cibc": [9],
    "venture capital": [9],
    "apple": [10, 11],
    "safari": [10],
    "custom silicon": [11],
    "microsoft": [12],
    "activision": [12],
    "amazon": [13],
    "aws": [13],
    "openai": [14],
    "ipo": [14],
    "cloud computing": [13],
    "technology forecast": [9, 10, 11, 13, 14],
    "banking": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
    "compliance": [1, 5, 6, 12],
    "risk management": [5, 7, 8]
  }
} 