[
  {
    "title": "TD Bank Downgraded by DBRS Over Governance and AML Failures",
    "source": "Investment Executive",
    "link": "https://www.investmentexecutive.com/news/research-and-markets/dbrs-downgrades-td-on-governance-issues-tariffs/?utm_source=chatgpt.com",
    "content": "DBRS downgraded TD Bank from AA (high) to AA on May 6, 2025, due to significant governance failures in its U.S. AML program and rising operational risks. The downgrade also reflects concerns over U.S. trade policy and a weakening operating environment, potentially impacting profitability and asset quality."
  },
  {
    "title": "Moody's Revises Outlook for Seven Thai Banks",
    "source": "Nation Thailand",
    "link": "https://www.nationthailand.com/business/banking-finance/40049495?utm_source=chatgpt.com",
    "content": "Moody's changed the outlook for seven Thai banks from Stable to Negative following a sovereign downgrade due to rising U.S. tariffs. A weakened economic recovery and fiscal pressure could affect loan growth and asset quality in the banking sector."
  },
  {
    "title": "Moody's Reviews IndusInd Bank Credit Assessment After Derivative Discrepancies",
    "source": "Reuters",
    "link": "https://www.reuters.com/business/finance/moodys-places-indusind-banks-credit-assessment-review-downgrade-2025-03-17/?utm_source=chatgpt.com",
    "content": "Moody's placed IndusInd Bank under review for downgrade in March 2025 after a $175 million discrepancy in derivative reporting. The bank faces questions about internal controls, capital adequacy, and leadership stability."
  },
  {
    "title": "Fitch Downgrades Blackstone Mortgage Trust on CRE Risk",
    "source": "Fitch Ratings",
    "link": "https://www.fitchratings.com/research/non-bank-financial-institutions/fitch-downgrades-blackstone-mortgage-idr-to-bb-outlook-stable-11-04-2025?utm_source=chatgpt.com",
    "content": "Fitch downgraded Blackstone Mortgage Trust's Long-Term IDR to BB- in April 2025 due to exposure to distressed commercial real estate loans, increasing the likelihood of credit losses in 2025."
  },
  {
    "title": "Fitch Downgrades China's Credit Rating to A",
    "source": "Fitch Ratings",
    "link": "https://www.fitchratings.com/research/sovereigns/fitch-downgrades-china-to-a-outlook-stable-03-04-2025?utm_source=chatgpt.com",
    "content": "Fitch downgraded China's sovereign credit rating from A+ to A in April 2025 due to fiscal strain and economic slowdown. This raises risk exposure for institutions heavily invested in or operating in China."
  },
  {
    "title": "Moody's Warns of U.S. Fiscal Deterioration, Revises Outlook",
    "source": "Peter G. Peterson Foundation",
    "link": "https://www.pgpf.org/article/moodys-lowers-us-credit-rating-to-negative-citing-large-federal-deficits/?utm_source=chatgpt.com",
    "content": "Moody's kept the U.S. at AAA but changed its outlook to negative in March 2025, citing sustained fiscal deficits and unfunded tax policies. The warning could impact banks with exposure to U.S. government securities."
  }
] 