{
  "ticker": "JPM",
  "company": "JPMorgan Chase & Co.",
  "extraction_date": "20250505_162358",
  "article_count": 1,
  "articles": [
    {
      "title": "Zimmer Biomet Holdings, Inc. (ZBH) Q1 2025 Earnings Call Transcript",
      "text": "Zimmer Biomet Holdings, Inc. (NYSE:ZBH) Q1 2025 Earnings Conference Call May 5, 2025 8:30 AM ET\n\nCompany Participants\n\nDavid DeMartino - SVP, IR\n\nIvan Tornos - President & CEO\n\nSuketu Upadhyay - CFO & EVP, Finance, Operations & Supply Chain\n\nConference Call Participants\n\nRobbie Marcus - JPMorgan\n\nDavid Roman - Goldman Sachs\n\nChris Pasquale - Nephron\n\nMatthew O'Brien - Piper Sandler\n\nMatthew Taylor - Jefferies\n\nLarry Biegelsen - Wells Fargo\n\nJosh Jennings - TD Cowen\n\nTravis Steed - Bank of America\n\nJoanne Wuensch - Citi\n\nCaitlin Cronin - Canaccord Genuity\n\nRichard Newitter - Truist Securities\n\nShagun Singh - RBC\n\nRick Wise - Stifel\n\nJeff Johnson - Baird\n\nMike Matson - Needham & Company\n\nOperator\n\nGood morning, ladies and gentlemen, and welcome to the Zimmer Biomet First Quarter 2025 Earnings Conference Call. [Operator Instructions] As a reminder, this conference is being recorded today, May 5, 2025. Following today's presentation, there will be a question-and-answer session. At this time, all participants are in a listen-only mode. [Operator Instructions]\n\nI would now like to turn the conference over to David DeMartino, Senior Vice President, Investor Relations. Please go ahead.\n\nDavid DeMartino\n\nThank you, operator, good morning, everyone. Welcome to Zimmer Biomet's first quarter 2025 earnings conference call. Joining me on today's call are Ivan Tornos, our President and CEO, and Suketu Upadhyay, our CFO and EVP of Finance, Operations, and Supply Chain.\n\nBefore we get started, I'd like to remind you that our comments during this call will include forward-looking statements. Actual results may differ materially from those indicated by the forward-looking statements, due to a variety of risks and uncertainties.\n\nFor a detailed discussion of all these risks and uncertainties, in addition to the inherent limitations of such forward-looking statements, please refer to our SEC filings. Please note, we assume no obligation to update these forward-looking",
      "url": "https://seekingalpha.com/article/4781856-zimmer-biomet-holdings-inc-zbh-q1-2025-earnings-call-transcript?source=feed_all_articles",
      "pub_date": null,
      "authors": [],
      "source": "seekingalpha.com"
    }
  ]
}